# 문자열 여러줄 입력받기 Ver.1

# graph = [input() for _ in range(5)]

# print(graph)
# 입력
# WLLWWWL
# LLLWLLL
# LWLWLWW
# LWLWLLL
# WLLWLWW

# 출력
# >> print(graph)
# ['WLLWWWL',
#  'LLLWLLL', 
#  'LWLWLWW', 
#  'LWLWLLL', 
#  'WLLWLWW']

#--------------------------------------------------------------------
# 문자열 여러줄 입력받기 Ver.2 

maze = [list(input()) for _ in range(5)]

print(maze)

# 입력
# 101111
# 101010
# 101011
# 111011

# 출력
# [[1, 0, 1, 1, 1, 1],
#  [1, 0, 1, 0, 1, 0], 
#  [1, 0, 1, 0, 1, 1], 
#  [1, 1, 1, 0, 1, 1]]

# -------------------------------------------------------------------------------
# 2차원 배열 입력받기
# arr = [list(map(int, input().split())) for _ in range(5)]

# print(arr)

# 입력
# 1 3 3 6 7
# 8 13 9 12 8
# 4 16 11 12 6
# 2 4 1 23 2
# 9 13 4 7 3

# 출력
# >> print(arr)
# [[1, 3, 3, 6, 7],
#  [8, 13, 9, 12, 8],
#  [4, 16, 11, 12, 6],
#  [2, 4, 1, 23, 2],
#  [9, 13, 4, 7, 3]]